In [1]:
import pandas as pd

# __Ques 1__

In [2]:
s = pd.Series([4,8,15,16,23,42])

In [3]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

## __Ques 2__

In [5]:
li = [i for i in range(10)]
s2 = pd.Series(li)
s2

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

## __Ques 3__

In [7]:
data = {
   "Name" : ["Alice","Bob","Claire"],
    "Age" : [25,30,37],
    "Gender" : ["Female","Male","Female"]
}

In [8]:
df = pd.DataFrame(data)

In [9]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   37  Female

In [10]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   37  Female

## __Ques 4__
In Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types, similar to a spreadsheet or a SQL table. It is one of the core data structures used for data analysis in Python. Each column in a DataFrame is a pandas Series, which is a one-dimensional labeled array capable of holding any data type.<br><br>
The main difference between a DataFrame and a Series is that a Series represents a single column of data, while a DataFrame is a collection of columns. In a DataFrame, each column can have a different data type, and columns can be labeled with column names. A Series, on the other hand, has only a single data type and is labeled with an index.<br>
In Data Frame we can't do indexing to access data while in data series we can do that

In [12]:
# creating a pandas Series
s = pd.Series([1, 2, 3, 4, 5])
print("Data Series")
print(s)

# creating a pandas DataFrame
data = {
    'name': ['John', 'Sara', 'Tom', 'Mia', 'Bob'],
    'age': [25, 30, 18, 42, 50],
    'country': ['USA', 'Canada', 'Australia', 'USA', 'Mexico']
}
df = pd.DataFrame(data)
print("\nData Frame")
print(df)

Data Series
0    1
1    2
2    3
3    4
4    5
dtype: int64

Data Frame
   name  age    country
0  John   25        USA
1  Sara   30     Canada
2   Tom   18  Australia
3   Mia   42        USA
4   Bob   50     Mexico

## __Ques 5__
1. __head(n=5):__ -> It shows the top n rows of data set , default value is 5. we can use this when we have to see top n rows of data only
2. __tail(n=5):__ ->  It shows the bottom n rows of data set , default value is 5. we can use this when we have to see bottom n rows of data only.
3. __sort_values(coloumn_name):__ -> it will return a sorted copy of the data frame. we can use this when we want to sort our column ex sorting based on names to give roll nmber in class
4. __drop():__ -> This function allows you to drop specific columns or rows from the DataFrame. For example, df.drop('column_name', axis=1) drops a column, and df.drop(0, axis=0) drops a row.

In [15]:
data = {
    'name': ['John', 'Sara', 'Tom', 'Mia', 'Bob'],
    'age': [25, 30, 18, 42, 50],
    'country': ['USA', 'Canada', 'Australia', 'USA', 'Mexico']
}

df = pd.DataFrame(df)
df

   name  age    country
0  John   25        USA
1  Sara   30     Canada
2   Tom   18  Australia
3   Mia   42        USA
4   Bob   50     Mexico

In [16]:
df.head(2)

   name  age country
0  John   25     USA
1  Sara   30  Canada

In [19]:
df.tail(2)

  name  age country
3  Mia   42     USA
4  Bob   50  Mexico

In [20]:
df.sort_values('name')

   name  age    country
4   Bob   50     Mexico
0  John   25        USA
3   Mia   42        USA
1  Sara   30     Canada
2   Tom   18  Australia

In [29]:
df.drop(1,axis=0)

   name  age    country
0  John   25        USA
2   Tom   18  Australia
3   Mia   42        USA
4   Bob   50     Mexico

## __Ques 6__
In Pandas, both Series and DataFrame are mutable in nature, which means that the values in these objects can be changed after they are created.

## __Ques 7__

In [30]:
name = pd.Series(['Himanshu' , 'Pandey'])
age = pd.Series([23 , 34])
gender = pd.Series(['Male' , 'Female'])

In [33]:
df = pd.DataFrame([name , age , gender])

In [34]:
df

          0       1
0  Himanshu  Pandey
1        23      34
2      Male  Female